package net.fiwzi.quiz.infrastructure.storages;

import java.util.List;

public class HomeNumber {
    public String msg;
    public String job;
    public List<String> recommend;
    public HomeNumber[] data;
    public HomeNumber() {
        data = new HomeNumber[] {
                new HomeNumber(
                        "ตัวเลขแห่งการเริ่มต้นใหม่ เปลี่ยนแปลง นำไปสู่สิ่งที่ดี",
                        "เจ้าของธุรกิจ, ผู้บริหาร",
                        List.of("เลือกวัสดุที่แข็งแรง เช่น เฟอร์นิเจอร์ไม้หรือหินแกรนิต")
                ),
                new HomeNumber(
                        "เป็นเลขแห่งผู้นำ บุคคลมีชื่อเสียง และหากบ้านไหนมีเลข 1 มักเต็มไปด้วยความเจริญรุ่งเรือง",
                        "ข้าราชการ",
                        List.of("เลือกเฟอร์นิเจอร์ที่มีโทนสีเย็น", "เสริมพื้นที่เนินสูงหน้าบ้าน")
                ),
                new HomeNumber(
                        "เปรียบเสมือนเป็นเลขของตัวแทนเรื่องความสวยความงาม หากเลขที่บ้านมีเลข 2 จะสามารถปรับตัวได้ แต่อาจขาดความคล่องตัว",
                        "นายหน้า, เจ้าของกิจการ",
                        List.of("นำน้ำเข้ามาเป็นส่วนหนึ่งของการตกแต่ง", "จัดระบบน้ำให้ปลอดภัย")
                ),
                new HomeNumber(
                        "ตัวเลขแห่งความใจร้อน ใจนักเลง ดังนั้นอาจจำเป็นต้องหลีกเลี่ยงเลข 3 ในเลขที่บ้าน",
                        "กลุ่มโรงงาน อุตสาหกรรม",
                        List.of("ปลูกต้นไม้ใหญ่ภายในบ้านเพื่อเสริมพลังงานบวก", "วางแจกันดอกไม้สีแดงที่กลางบ้าน")
                ),
                new HomeNumber(
                        "ตัวเลขนี้สื่อถึงการเจรจา สื่อสาร หากบ้านไหนมีเลข 4 จะเหมาะกับกลุ่มพ่อค้า แม่ค้า",
                        "กลุ่มงานไอที, เจ้าของกิจการ, ค้าขาย, นายหน้า",
                        List.of("รักษาความเป็นระเบียบเรียบร้อย", "ปลูกต้นไม้ดอกที่มีกลิ่นหอมเย็น เช่น ต้นโมก")
                ),
                new HomeNumber(
                        "เป็นเลขมงคลที่สื่อถึงความสุข ความมั่นคง ถือได้ว่าเป็นหนึ่งในเลขมงคลสุดฮิตของเลขที่บ้าน",
                        "ครู, ข้าราชการ, นักกฎหมาย",
                        List.of("ตกแต่งบ้านในโทนสีสว่าง", "วางเกียรติบัตรในห้องรับแขก")
                ),
                new HomeNumber(
                        "เลขคู่ที่สื่อถึงความรัก ความสุข หากถูกจับคู่กับเลขดี ชีวิตของสมาชิกในบ้านจะพบเจอแต่เรื่องดีตามไปด้วย",
                        "ค้าขาย, เจ้าของร้านอาหาร, กลุ่มอาชีพความคิด",
                        List.of("เลือกของประดับที่มีความสุนทรีย์", "แขวนกระดิ่งหรือโมบายเสียงไพเราะ")
                ),
                new HomeNumber(
                        "เปรียบเสมือนเป็นเลขแห่งการทำงาน ความขยัน ทำอะไรอาจจะเหนื่อยสักหน่อย",
                        "อสังหาฯ, เกษตรกรรม",
                        List.of("เคลียร์ของเก่าที่ไม่จำเป็น", "ตกแต่งด้วยวัสดุไม้หรือสีน้ำตาล")
                ),
                new HomeNumber(
                        "ตามความเชื่อของโหราศาสตร์ เลข 8 คือเลขราหู เสริมดวงสำหรับผู้ทำงานออนไลน์หรือต่างประเทศ",
                        "ผู้บริหาร, ค้าขาย, เจ้าของธุรกิจ",
                        List.of("ตกแต่งบ้านด้วยภาพหรือวัตถุมงคล")
                ),
                new HomeNumber(
                        "เลขมงคล เลขศักดิ์สิทธิ์ เป็นเลขที่ดี เหมาะกับทุกบ้าน สมาชิกทุกอาชีพ",
                        "นายหน้า, ครู, หมอ, พยาบาล",
                        List.of("ให้ความสำคัญกับความสะอาด", "ตกแต่งบ้านด้วยไม้มงคล")
                )
        };
    }

    private HomeNumber(String msg, String job, List<String> recommend) {
        this.msg = msg;
        this.job = job;
        this.recommend = recommend;
    }

//    public
}
